000100161128     d test            s              1
000200161128     d inna            s              3i 0
000300161128     d znak1           s              2a
000400161128     d decim           s              3p 0
000500161128      /free
000600161128                inna = 8;
000700161128                znak1 = 'abc';
000800161128                dsply znak1;
000900161128                decim = 9999;
001000161128                dsply decim;
001100161128                *inlr = *on;
001200161128      /end-free
